Задача: Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.

Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно.

В примере мы считываем числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов, не обращая внимания на то, что остались ещё не прочитанные значения.

Мое решение.
1. Вввод в одну стоку 

a=[int(i) for i in input().split()]
b=[]
c=[]
for i in a:
    b.append(i)
    if sum(b)==0:
        break
for j in b:
    c.append(j**2)
print(sum(c))

2.Ввод с новой строки 

b=[int(input())]
c=[]
while sum(b)!=0:
    a=int(input())
    b.append(a)
for j in b:
    c.append(j**2)
print(sum(c))


3.Лучшее решение с курса 

s=[int(input())]
while sum(s)!=0: s.append(int(input()))
print(sum([i**2 for i in s]))