Задание:
	Напишите программу, которая считывает строку с числом nn, которое задаёт количество чисел, которые нужно считать. Далее считывает nn строк с числами x_ix 
i
​	
 , по одному числу в каждой строке. Итого будет n+1n+1 строк.

При считывании числа x_ix 
i
​	
  программа должна на отдельной строке вывести значение f(x_i)f(x 
i
​	
 ). Функция f(x) уже реализована и доступна для вызова. 

Функция вычисляется достаточно долго и зависит только от переданного аргумента xx. Для того, чтобы уложиться в ограничение по времени, нужно избежать повторного вычисления значений.

Мое решение:

a={}
n=int(input())
for i in range(n):
    b=int(input())
    if b in a:
        print(a[b])
    else:
        a[b]=f(b)
        print(a[b])


Лучшее решение:

a=[int(input()) for i in range(int(input()))]
b={x:f(x) for x in set(a)}
for i in a:
    print(b[i])